; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v5 ?v1)
             (pred_4 ?v10 ?v3)
             (pred_5 ?v5 ?v3)
             (pred_1 ?v8 ?v5 )
	     (pred_11 ?v5)
             (pred_3 ?v6)
             (pred_10 ?v10)
             (pred_2 ?v3)
             (pred_12 ?v5)
             (pred_9 ?v10)
             (pred_8 ?v5)
             (pred_7 ))



(:action op_4
:parameters (?v13 ?v2 ?v11 ?v12)
:precondition (and (pred_3 ?v13) (pred_3 ?v2) (pred_10 ?v11) (pred_2 ?v12)
          (pred_6 ?v13 ?v2) (pred_4 ?v11 ?v12)
                   (pred_5 ?v2 ?v12) (pred_11 ?v13) 
                   (pred_12 ?v2) (pred_9 ?v11))
:effect (and  (pred_8 ?v2) (not (pred_12 ?v2))))


(:action op_3
:parameters (?v13 ?v9)
:precondition (and (pred_3 ?v13) (pred_3 ?v9)
               (pred_11 ?v13) (pred_6 ?v13 ?v9) (pred_8 ?v9))
:effect (and (pred_11 ?v9) (not (pred_11 ?v13))))

(:action op_2
:parameters (?v13 ?v11)
:precondition (and (pred_3 ?v13) (pred_10 ?v11) 
                  (pred_11 ?v13) (pred_1 ?v11 ?v13) (pred_7 ))
:effect (and (pred_9 ?v11)
   (not (pred_1 ?v11 ?v13)) (not (pred_7 ))))


(:action op_5
:parameters (?v13 ?v7 ?v4)
:precondition (and (pred_3 ?v13) (pred_10 ?v7) (pred_10 ?v4)
                  (pred_11 ?v13) (pred_9 ?v4) (pred_1 ?v7 ?v13))
:effect (and (pred_9 ?v7) (pred_1 ?v4 ?v13)
        (not (pred_9 ?v4)) (not (pred_1 ?v7 ?v13))))

(:action op_1
:parameters (?v13 ?v11)
:precondition (and (pred_3 ?v13) (pred_10 ?v11) 
                  (pred_11 ?v13) (pred_9 ?v11))
:effect (and (pred_7 ) (pred_1 ?v11 ?v13) (not (pred_9 ?v11)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_26 obj_05 obj_14 obj_18 obj_21 obj_13 obj_23 obj_20 obj_09 obj_10 obj_22 obj_30 obj_07 obj_01 obj_11 obj_27 obj_08 obj_31 obj_06 obj_29 obj_02 obj_28 obj_15 obj_04 obj_25
    obj_03 obj_17 obj_16
    obj_32 obj_19 obj_12 obj_24
    )

    (:init
       (pred_7)

       (pred_3 obj_26)
       (pred_3 obj_05)
       (pred_3 obj_14)
       (pred_3 obj_18)
       (pred_3 obj_21)
       (pred_3 obj_13)
       (pred_3 obj_23)
       (pred_3 obj_20)
       (pred_3 obj_09)
       (pred_3 obj_10)
       (pred_3 obj_22)
       (pred_3 obj_30)
       (pred_3 obj_07)
       (pred_3 obj_01)
       (pred_3 obj_11)
       (pred_3 obj_27)
       (pred_3 obj_08)
       (pred_3 obj_31)
       (pred_3 obj_06)
       (pred_3 obj_29)
       (pred_3 obj_02)
       (pred_3 obj_28)
       (pred_3 obj_15)
       (pred_3 obj_04)
       (pred_3 obj_25)
       (pred_2 obj_03)
       (pred_2 obj_17)
       (pred_2 obj_16)
       (pred_10 obj_32)
       (pred_10 obj_19)
       (pred_10 obj_12)
       (pred_10 obj_24)

       (pred_6 obj_26 obj_13)
       (pred_6 obj_26 obj_05)
       (pred_6 obj_05 obj_23)
       (pred_6 obj_05 obj_14)
       (pred_6 obj_05 obj_26)
       (pred_6 obj_14 obj_20)
       (pred_6 obj_14 obj_18)
       (pred_6 obj_14 obj_05)
       (pred_6 obj_18 obj_09)
       (pred_6 obj_18 obj_21)
       (pred_6 obj_18 obj_14)
       (pred_6 obj_21 obj_10)
       (pred_6 obj_21 obj_18)
       (pred_6 obj_13 obj_22)
       (pred_6 obj_13 obj_23)
       (pred_6 obj_13 obj_26)
       (pred_6 obj_23 obj_30)
       (pred_6 obj_23 obj_20)
       (pred_6 obj_23 obj_05)
       (pred_6 obj_23 obj_13)
       (pred_6 obj_20 obj_07)
       (pred_6 obj_20 obj_09)
       (pred_6 obj_20 obj_14)
       (pred_6 obj_20 obj_23)
       (pred_6 obj_09 obj_01)
       (pred_6 obj_09 obj_10)
       (pred_6 obj_09 obj_18)
       (pred_6 obj_09 obj_20)
       (pred_6 obj_10 obj_11)
       (pred_6 obj_10 obj_21)
       (pred_6 obj_10 obj_09)
       (pred_6 obj_22 obj_27)
       (pred_6 obj_22 obj_30)
       (pred_6 obj_22 obj_13)
       (pred_6 obj_30 obj_08)
       (pred_6 obj_30 obj_07)
       (pred_6 obj_30 obj_23)
       (pred_6 obj_30 obj_22)
       (pred_6 obj_07 obj_31)
       (pred_6 obj_07 obj_01)
       (pred_6 obj_07 obj_20)
       (pred_6 obj_07 obj_30)
       (pred_6 obj_01 obj_06)
       (pred_6 obj_01 obj_11)
       (pred_6 obj_01 obj_09)
       (pred_6 obj_01 obj_07)
       (pred_6 obj_11 obj_29)
       (pred_6 obj_11 obj_10)
       (pred_6 obj_11 obj_01)
       (pred_6 obj_27 obj_02)
       (pred_6 obj_27 obj_08)
       (pred_6 obj_27 obj_22)
       (pred_6 obj_08 obj_28)
       (pred_6 obj_08 obj_31)
       (pred_6 obj_08 obj_30)
       (pred_6 obj_08 obj_27)
       (pred_6 obj_31 obj_15)
       (pred_6 obj_31 obj_06)
       (pred_6 obj_31 obj_07)
       (pred_6 obj_31 obj_08)
       (pred_6 obj_06 obj_04)
       (pred_6 obj_06 obj_29)
       (pred_6 obj_06 obj_01)
       (pred_6 obj_06 obj_31)
       (pred_6 obj_29 obj_25)
       (pred_6 obj_29 obj_11)
       (pred_6 obj_29 obj_06)
       (pred_6 obj_02 obj_28)
       (pred_6 obj_02 obj_27)
       (pred_6 obj_28 obj_15)
       (pred_6 obj_28 obj_08)
       (pred_6 obj_28 obj_02)
       (pred_6 obj_15 obj_04)
       (pred_6 obj_15 obj_31)
       (pred_6 obj_15 obj_28)
       (pred_6 obj_04 obj_25)
       (pred_6 obj_04 obj_06)
       (pred_6 obj_04 obj_15)
       (pred_6 obj_25 obj_29)
       (pred_6 obj_25 obj_04)
       (pred_12 obj_08)
       (pred_12 obj_14)
       (pred_12 obj_23)
       (pred_12 obj_07)
       (pred_5  obj_08 obj_03)
       (pred_5  obj_14 obj_17)
       (pred_5  obj_23 obj_16)
       (pred_5  obj_07 obj_03)
       (pred_8 obj_26)
       (pred_8 obj_05)
       (pred_8 obj_18)
       (pred_8 obj_21)
       (pred_8 obj_13)
       (pred_8 obj_20)
       (pred_8 obj_09)
       (pred_8 obj_10)
       (pred_8 obj_22)
       (pred_8 obj_30)
       (pred_8 obj_01)
       (pred_8 obj_11)
       (pred_8 obj_27)
       (pred_8 obj_31)
       (pred_8 obj_06)
       (pred_8 obj_29)
       (pred_8 obj_02)
       (pred_8 obj_28)
       (pred_8 obj_15)
       (pred_8 obj_04)
       (pred_8 obj_25)

       (pred_4  obj_32 obj_03)
       (pred_4  obj_19 obj_17)
       (pred_4  obj_12 obj_16)
       (pred_4  obj_24 obj_17)
       (pred_1 obj_32 obj_06)
       (pred_1 obj_19 obj_20)
       (pred_1 obj_12 obj_04)
       (pred_1 obj_24 obj_18)
       (pred_11 obj_29)
    )

    (:goal (and
       (pred_1 obj_19 obj_21)
       (pred_1 obj_24 obj_11)
    ))
(:constraints
  (always (not (pred_11 obj_01)))
)
)

; plan
1. (op_3 obj_29 obj_11)
   deleted: (pred_11 obj_29)
   added: (pred_11 obj_11)
   goals met: 0 of 2
2. (op_3 obj_11 obj_10)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_10)
   goals met: 0 of 2
3. (op_3 obj_10 obj_09)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_09)
   goals met: 0 of 2
4. (op_3 obj_09 obj_20)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_20)
   goals met: 0 of 2
5. (op_2 obj_20 obj_19)
   deleted: (pred_1 obj_19 obj_20) (pred_7)
   added: (pred_9 obj_19)
   goals met: 0 of 2
6. (op_3 obj_20 obj_09)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_09)
   goals met: 0 of 2
7. (op_3 obj_09 obj_18)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_18)
   goals met: 0 of 2
8. (op_3 obj_18 obj_21)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_21)
   goals met: 0 of 2
9. (op_1 obj_21 obj_19)
   deleted: (pred_9 obj_19)
   added: (pred_7) (pred_1 obj_19 obj_21)
   goals met: 1 of 2
10. (op_3 obj_21 obj_18)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_18)
   goals met: 1 of 2
11. (op_2 obj_18 obj_24)
   deleted: (pred_1 obj_24 obj_18) (pred_7)
   added: (pred_9 obj_24)
   goals met: 1 of 2
12. (op_3 obj_18 obj_21)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_21)
   goals met: 1 of 2
13. (op_3 obj_21 obj_10)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_10)
   goals met: 1 of 2
14. (op_3 obj_10 obj_11)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_11)
   goals met: 1 of 2
15. (op_1 obj_11 obj_24)
   deleted: (pred_9 obj_24)
   added: (pred_7) (pred_1 obj_24 obj_11)
   goals met: 2 of 2
